rethinkingTheMethodologyOfExam--withTheInstanceOfIELTsPreperation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-09-22 五 07:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rethinking the Methodology of Handling EXAMS : a Case Study and Conclusion from IELTs</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rethinking the Methodology of Handling EXAMS : a Case Study and Conclusion from IELTs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org668192b">1. SWITCH MODE: you cannot prepare an exam without pressure, planning, and time</a>
<ul>
<li><a href="#orgaa02b75">1.1. Reference of this methodology</a></li>
<li><a href="#org9d2eaea">1.2. Definite the MODE for your EXAM</a>
<ul>
<li><a href="#org55b3977">1.2.1. SELECT the RIGHT KPI</a></li>
<li><a href="#orgf70aa3e">1.2.2. REORGANIZE all your activity to THINGS related to this EXAM</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org690b987">2. SIMULATION or PRACTICE: in REAL-WAR</a>
<ul>
<li><a href="#orgf36176c">2.1. Set a deadline.</a></li>
<li><a href="#orgceaa488">2.2. Simulation</a>
<ul>
<li><a href="#org49e1da7">2.2.1. Collect materials.</a></li>
<li><a href="#orge51b7cd">2.2.2. Practice methodology</a>
<ul>
<li><a href="#orgfd057a5">2.2.2.1. Knowing the basic types of the exam</a></li>
<li><a href="#orga605053">2.2.2.2. Improve by repitition which is not a repitition</a></li>
<li><a href="#org12eee47">2.2.2.3. Let the bullet run, and waiting.</a></li>
</ul>
</li>
<li><a href="#org384707d">2.2.3. Summerize the fomulatic approachs</a>
<ul>
<li><a href="#org3db3b9d">2.2.3.1. At first, just search from the INTERNET, to seek them, are read them.</a></li>
<li><a href="#orgd36dd0c">2.2.3.2. Repeat this procedure of "simulation, summerize the fomulatic approachs"&#x2026;</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
NOTE: this tutorial can help you to handle a specific type of exams, on which you might want to obtain a expected SCORE which will influence the futre significantly, if you have a terrible results. I summerize three points for you to handle an exam easily, which can be seen as follows:
</p>

<div id="outline-container-org668192b" class="outline-2">
<h2 id="org668192b"><span class="section-number-2">1.</span> SWITCH MODE: you cannot prepare an exam without pressure, planning, and time</h2>
<div class="outline-text-2" id="text-1">
<p>
I believe there exists two types of "life mode"  for most of the people, like "work mode" with less pressure but the concentration of works, "relax mode" just do nothing, and so on. If you need to prepare an exam which is important for you and you know you even will not learn that after the exam, then I think you should switch to a specific new mode for this exam. That is to say, you'd better force yourself on it during a quite narrow periods, and try your best to battle for the expected results &#x2013; you will not do it again in future. <b>You can see from this describtion that you are not favour in this exam, the prepartion procedure is boring, and even painful.</b> What you need to do is, find a best solution, a methodology, to pass it, to fulfill the requirements of the exam score, in a given priod of your lifetime. I called what you do in this periods as a new "MODE".
</p>
</div>

<div id="outline-container-orgaa02b75" class="outline-3">
<h3 id="orgaa02b75"><span class="section-number-3">1.1.</span> Reference of this methodology</h3>
<div class="outline-text-3" id="text-1-1">
<p>
根据《阮一峰的网络日志》中对纳瓦尔的引用，纳瓦尔对赚钱提出了三条建议：
</p>
<ol class="org-ol">
<li>The most important and determinuted factor of success is not working hard, it is a serious decision of selecting your work, your staff (collabrators), and your project.</li>
<li>The most effective work methodology, is not like marathon which focusing on preserverance, but a burst when you need a burst, and other times stay healthy and great.</li>
<li>You must be like a lion, leaping into action at the sight of opportunity,instead of a cow, working from dawn to night.</li>
</ol>
</div>
</div>


<div id="outline-container-org9d2eaea" class="outline-3">
<h3 id="org9d2eaea"><span class="section-number-3">1.2.</span> Definite the MODE for your EXAM</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org55b3977" class="outline-4">
<h4 id="org55b3977"><span class="section-number-4">1.2.1.</span> SELECT the RIGHT KPI</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>TIME we pay on
<ul class="org-ul">
<li>We should set a netherworld, a  threshold you must learn every day at least</li>
<li>But you cannot define your target from time, because time is not linearly relative to the score. It will cause "low-efficiency".</li>
</ul></li>
<li>Score of simulations
<ul class="org-ul">
<li>Yes, you need that. If you can achieve 130\% at least of score of your expected finally score, then, you are OK for exam.</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgf70aa3e" class="outline-4">
<h4 id="orgf70aa3e"><span class="section-number-4">1.2.2.</span> REORGANIZE all your activity to THINGS related to this EXAM</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
You need to transform all your hobbies and others in this periods, to the things related to your exam.
Take IELTS as an example, you should:
</p>
<ol class="org-ol">
<li>read English books if you like read books.</li>
<li>watch English TV or movies if you like watch videos.</li>
<li>listen to English music if you like to listen to music.</li>
<li>Writting in English if you need to write something.</li>
<li>Replace the self-speaking in your heart into English if you&#x2026;</li>
<li>and so on.</li>
</ol>


<p>
You can take 30 minutes to swtich all of your apps, and materials to that.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org690b987" class="outline-2">
<h2 id="org690b987"><span class="section-number-2">2.</span> SIMULATION or PRACTICE: in REAL-WAR</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf36176c" class="outline-3">
<h3 id="orgf36176c"><span class="section-number-3">2.1.</span> Set a deadline.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
NOT up to one month.
</p>

<p>
If you set a deadline, just do it. Don't say: I am not prepared. You will never be well-prepared. Just do it, receive the result that you failed, and do it again.
</p>
</div>
</div>

<div id="outline-container-orgceaa488" class="outline-3">
<h3 id="orgceaa488"><span class="section-number-3">2.2.</span> Simulation</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org49e1da7" class="outline-4">
<h4 id="org49e1da7"><span class="section-number-4">2.2.1.</span> Collect materials.</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
in 60 minutes.
</p>
</div>
</div>


<div id="outline-container-orge51b7cd" class="outline-4">
<h4 id="orge51b7cd"><span class="section-number-4">2.2.2.</span> Practice methodology</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<div id="outline-container-orgfd057a5" class="outline-5">
<h5 id="orgfd057a5"><span class="section-number-5">2.2.2.1.</span> Knowing the basic types of the exam</h5>
<div class="outline-text-5" id="text-2-2-2-1">
<ul class="org-ul">
<li>how much questions in your exam?</li>
<li>summerize the types of the questions</li>
<li>in these questions you are afraid of</li>
<li>the discrepancy between your expected score and now your score</li>
</ul>
</div>
</div>


<div id="outline-container-orga605053" class="outline-5">
<h5 id="orga605053"><span class="section-number-5">2.2.2.2.</span> Improve by repitition which is not a repitition</h5>
<div class="outline-text-5" id="text-2-2-2-2">
<p>
Based on the bilibili video of "我不是肥宅", I summerize some of the key points to improve IELTS scores:
</p>
<ol class="org-ol">
<li>At first, we should focused on give a "correct" result without time limitation. For instance, we can listen to the materials time by time until we make sure we have all tracked the correct answer of the questions. Finally, we can check the results to see if we have a idea score of what we want.</li>
<li>Regard ourselves as a neural network with a low but stable learning rate, and consider this simulation is the training data. The reward is the score we obttained.</li>
</ol>


<p>
NOTE that: <b>You must make progress everyday, where the progress is what you can see obviously by your own eyes, not something like "Oh today I have spent three pure hours on  that and it is Okay". NO, you must do that, you must earn the reward for your attemptions today. In any way, you must get the progress, even a quite tiny one. This is the keypoint for your improvements.*</b>
</p>
</div>
</div>


<div id="outline-container-org12eee47" class="outline-5">
<h5 id="org12eee47"><span class="section-number-5">2.2.2.3.</span> Let the bullet run, and waiting.</h5>
</div>
</div>


<div id="outline-container-org384707d" class="outline-4">
<h4 id="org384707d"><span class="section-number-4">2.2.3.</span> Summerize the fomulatic approachs</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<div id="outline-container-org3db3b9d" class="outline-5">
<h5 id="org3db3b9d"><span class="section-number-5">2.2.3.1.</span> At first, just search from the INTERNET, to seek them, are read them.</h5>
</div>

<div id="outline-container-orgd36dd0c" class="outline-5">
<h5 id="orgd36dd0c"><span class="section-number-5">2.2.3.2.</span> Repeat this procedure of "simulation, summerize the fomulatic approachs"&#x2026;</h5>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sat Sep 16 19:21:43 2023</p>
<p class="author">Author: Zi Liang</p>
<p class="date">Created: 2023-09-22 五 07:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
